---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.ForwardIterator
source: html/4ff143f0-2f34-acbe-f938-077d4f945758.htm
---
# Autodesk.Revit.DB.CurveArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.